rodrigoschamber/esp-maju-vdp/sdkconfig.defaults
# ESP32-DevKitC V4 (modulo ESP32-WROOM-32UE)
CONFIG_IDF_TARGET="esp32"

# Flash de 4 MB (variante N4). Ajuste para 8MB/16MB se a sua placa for N8/N16.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Monitor serial
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
